# ValueParsingOptions Class

---
Options for parsing strings into numbers with units.
SystemObject Autodesk.Revit.DBValueParsingOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ValueParsingOptions : IDisposable

    Public Class ValueParsingOptions
    	Implements IDisposable

    public ref class ValueParsingOptions : IDisposable

    type ValueParsingOptions =
        class
            interface IDisposable
        end
The ValueParsingOptions type exposes the following members.
| Name| Description
---|---|---
| ValueParsingOptions|  Creates a new ValueParsingOptions object with default settings.
Top
| Name| Description
---|---|---
| AllowedValues|  The allowable range of values to be parsed.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ValueParsingOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetFormatOptions|  Gets the FormatOptions to optionally override the default settings in the Units class.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| SetFormatOptions|  Sets the FormatOptions to optionally override the default settings in the Units class.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace